08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     scalarTransportFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          0.05;

writeControl    runTime;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

// ************************************************************************* //

functions
{
    surfaceFieldValue1
    {
            // Mandatory entries (unmodifiable)
            type            surfaceFieldValue;
            libs            (fieldFunctionObjects);

            // Mandatory entries (runtime modifiable)
            fields          (T);
            operation       areaAverage;
            regionType      patch;
            name            outlet;

            // Optional entries (runtime modifiable)
            postOperation   none;
            weightField     phi;
            scaleFactor     1.0;
            writeArea       false;
            surfaceFormat   none;

            // Optional (inherited) entries
            writeFields     false;
            scalingFactor   1.0;
            writePrecision  8;
            writeToFile     true;
            //writeControl    writeTime;
            writeControl    timeStep;
            writeInterval   10;
    }
}