08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "60";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4480
(
(-0.00020752 0 0.000207189)
(-0.000435656 0 0.000269232)
(-0.000849038 0 0.000302501)
(-0.00130058 0 0.000325118)
(-0.00176755 0 0.000333963)
(-0.00223483 0 0.000328186)
(-0.00268391 0 0.000308475)
(-0.00309568 0 0.000275486)
...
)
;

boundaryField
{
    walls
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.1);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 4((0.0412006 0 -0.0809696) (0.0179887 0 -0.101682) (-0.0114962 0 -0.103412) (-0.0362228 0 -0.083714));
    }
}


// ************************************************************************* //
