08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    uniformFixedValue;

        uniformValue
        {
            type    constant;
            value   1.0;
        }
    }
    
    outlet
    {
        type    zeroGradient;
    }
    
    walls
    {
        type    zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
