08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/0/UMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "60";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4480
(
(-0.000205436 0 0.000205097)
(-0.000431324 0 0.000266544)
(-0.000840642 0 0.000299505)
(-0.00128778 0 0.000321914)
(-0.00175021 0 0.000330682)
(-0.00221296 0 0.00032496)
(-0.00265767 0 0.00030543)
(-0.00306542 0 0.000272737)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
136
(
(0.000697035 0 0)
(0.00142324 0 0)
(0.00276132 0 0)
(0.00426582 0 0)
(0.00588858 0 0)
(0.00760979 0 0)
(0.00940281 0 0)
(0.0112422 0 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 -0.1);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 4((0.0412706 0 -0.080943) (0.018069 0 -0.101663) (-0.0114089 0 -0.103429) (-0.0361612 0 -0.0837414));
    }
}


// ************************************************************************* //
