08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "60";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.00126562;

boundaryField
{
    walls
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           nonuniform List<scalar> 
64
(
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
...
)
;
    }
    top
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           nonuniform List<scalar> 
136
(
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
...
)
;
    }
    bottom
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           nonuniform List<scalar> 
136
(
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.00126562;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.00126562;
    }
}


// ************************************************************************* //
