08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "60";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
8788
(
-6.97763e-07
6.97763e-07
-1.63301e-06
9.35248e-07
-2.69405e-06
1.06104e-06
-3.83362e-06
1.13957e-06
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 4(-0.00025 -0.00025 -0.00025 -0.00025);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 4(0.0002233 0.000270017 0.00027495 0.000231733);
    }
}


// ************************************************************************* //
