08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishScalar2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        norm            default;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

/*
SIMPLE
{
    nNonOrthogonalCorrectors 0;

    relaxationFactors
    {
        field
        {
            T       0.5;
        }
        equation
        {
            T       0.5;
        }
    }

}
*/


// ************************************************************************* //
